app/controllers/static_pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
def welcome
	@user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
def users
    @user = User.find(params[:id])

SELECT "gossips".* FROM "gossips"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
def acceuil
	@texte = []
	@auteur = []
		@gossip = Gossip.all
	 	@gossip.each do |gossip|
		@texte << gossip.title
		@auteur << gossip.user_id
end
	@final = []
		@auteur.each do |auteur|
		@final << User.find_by_id(auteur).first_name

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
def gossips
@gossips = Gossip.find_by_id(params[:id])
@user = User.find_by_id(@gossips.user_id)